# WEEK 3 - DATA CLEANSING AND MISSING DATA - 23.01

# Project Challenges

Clean Gapminder

Hint: one of the files is not a .csv and must be read in using a pandas function other than read_csv()

Related files:
- fertility_rate.csv (1 MB)
- life_expectancy.xls (3 MB)

In [15]:
import pandas as pd

In [16]:
!ls

data                     gapminder_total_pc.ipynb project_gapminder.ipynb

In [17]:
#1. Rename columns: use the method from the example above to properly name any columns that seem mislabeled in 
# the population dataset. The population dataset was given in the EDA lesson warmer


data = pd.read_csv('data/fertility_rate.csv')
data

        Total fertility rate  year  fertility
0                   Abkhazia  1800        NaN
1                Afghanistan  1800       7.00
2      Akrotiri and Dhekelia  1800        NaN
3                    Albania  1800       4.60
4                    Algeria  1800       6.99
...                      ...   ...        ...
56154                  Yemen  2015       3.83
56155             Yugoslavia  2015        NaN
56156                 Zambia  2015       5.59
56157               Zimbabwe  2015       3.35
56158                  Åland  2015        NaN

[56159 rows x 3 columns]

In [18]:
data.head()

    Total fertility rate  year  fertility
0               Abkhazia  1800        NaN
1            Afghanistan  1800       7.00
2  Akrotiri and Dhekelia  1800        NaN
3                Albania  1800       4.60
4                Algeria  1800       6.99

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56159 entries, 0 to 56158
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Total fertility rate  56159 non-null  object
 1   year                  56159 non-null  int64
 2   fertility             43412 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ MB

In [20]:
data.columns

Index(['Total fertility rate', 'year', 'fertility'], dtype='object')

In [21]:
data.columns = ['Total fertility rate', 'year', 'fertility']

In [22]:
data.head()

    Total fertility rate  year  fertility
0               Abkhazia  1800        NaN
1            Afghanistan  1800       7.00
2  Akrotiri and Dhekelia  1800        NaN
3                Albania  1800       4.60
4                Algeria  1800       6.99

In [23]:
data.rename(columns={'Total fertility rate' : 'country'})

                     country  year  fertility
0                   Abkhazia  1800        NaN
1                Afghanistan  1800       7.00
2      Akrotiri and Dhekelia  1800        NaN
3                    Albania  1800       4.60
4                    Algeria  1800       6.99
...                      ...   ...        ...
56154                  Yemen  2015       3.83
56155             Yugoslavia  2015        NaN
56156                 Zambia  2015       5.59
56157               Zimbabwe  2015       3.35
56158                  Åland  2015        NaN

[56159 rows x 3 columns]

In [24]:
data.rename(columns={'Total fertility rate' : 'country'}, 
            inplace=True)

In [25]:
data.head()

                 country  year  fertility
0               Abkhazia  1800        NaN
1            Afghanistan  1800       7.00
2  Akrotiri and Dhekelia  1800        NaN
3                Albania  1800       4.60
4                Algeria  1800       6.99

In [26]:
#2. Missing data: first check and see which and how much data is missing in the population dataset

data.isnull().sum()

country          0
year             0
fertility    12747
dtype: int64

In [27]:
#3. Remove missing data: drop all observations with missing data

data.dropna(inplace=True)

In [28]:
data.isnull().sum()

country      0
year         0
fertility    0
dtype: int64

In [29]:
#4. Filter for relevant data: filter the dataset that it begins with the year 1950

boolean_mask_f = data['year']> 1949
data = data[boolean_mask_f]
data

                     country  year  fertility
39001            Afghanistan  1950       7.67
39003                Albania  1950       5.80
39004                Algeria  1950       7.65
39007                 Angola  1950       6.93
39009    Antigua and Barbuda  1950       4.45
...                      ...   ...        ...
56150                Vietnam  2015       1.70
56151  Virgin Islands (U.S.)  2015       2.45
56154                  Yemen  2015       3.83
56156                 Zambia  2015       5.59
56157               Zimbabwe  2015       3.35

[13262 rows x 3 columns]

In [30]:
#5. Make data persistant: save the dataset as a .csv file in your data folder as they will be used for the week’s
#project

data.to_csv('data/fertility_1950.csv', index=False)

In [31]:
#6. Repeat for the the life_expectancy, and fertility_rate datasets which are available below

import pandas as pd

In [32]:
data = pd.read_csv('data/population.csv')
data

                                   Total population  year  population
0                                          Abkhazia  1800         NaN
1                                       Afghanistan  1800   3280000.0
2                             Akrotiri and Dhekelia  1800         NaN
3                                           Albania  1800    410445.0
4                                           Algeria  1800   2503218.0
...                                             ...   ...         ...
22270                             Northern Marianas  2015         NaN
22271  South Georgia and the South Sandwich Islands  2015         NaN
22272                     US Minor Outlying Islands  2015         NaN
22273                                Virgin Islands  2015         NaN
22274                                     West Bank  2015         NaN

[22275 rows x 3 columns]

In [33]:
data.head()

        Total population  year  population
0               Abkhazia  1800         NaN
1            Afghanistan  1800   3280000.0
2  Akrotiri and Dhekelia  1800         NaN
3                Albania  1800    410445.0
4                Algeria  1800   2503218.0

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22275 entries, 0 to 22274
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Total population  22275 non-null  object
 1   year              22275 non-null  int64
 2   population        20176 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 522.2+ KB

In [35]:
data.columns

Index(['Total population', 'year', 'population'], dtype='object')

In [36]:
data.columns = ['Total population', 'year', 'population']

In [37]:
data.head()

        Total population  year  population
0               Abkhazia  1800         NaN
1            Afghanistan  1800   3280000.0
2  Akrotiri and Dhekelia  1800         NaN
3                Albania  1800    410445.0
4                Algeria  1800   2503218.0

In [38]:
data.rename(columns={'Total population' : 'country'})

                                            country  year  population
0                                          Abkhazia  1800         NaN
1                                       Afghanistan  1800   3280000.0
2                             Akrotiri and Dhekelia  1800         NaN
3                                           Albania  1800    410445.0
4                                           Algeria  1800   2503218.0
...                                             ...   ...         ...
22270                             Northern Marianas  2015         NaN
22271  South Georgia and the South Sandwich Islands  2015         NaN
22272                     US Minor Outlying Islands  2015         NaN
22273                                Virgin Islands  2015         NaN
22274                                     West Bank  2015         NaN

[22275 rows x 3 columns]

In [39]:
data.rename(columns={'Total population' : 'country'}, 
            inplace=True)

In [40]:
data.head()

                 country  year  population
0               Abkhazia  1800         NaN
1            Afghanistan  1800   3280000.0
2  Akrotiri and Dhekelia  1800         NaN
3                Albania  1800    410445.0
4                Algeria  1800   2503218.0

In [41]:
data.isnull().sum()

country          0
year             0
population    2099
dtype: int64

In [42]:
data.dropna(inplace=True)

In [43]:
data.isnull().sum()

country       0
year          0
population    0
dtype: int64

In [44]:
boolean_mask_f = data['year']> 1949
data = data[boolean_mask_f]
data

                         country  year  population
4126                 Afghanistan  1950   7752118.0
4127       Akrotiri and Dhekelia  1950     10661.0
4128                     Albania  1950   1263171.0
4129                     Algeria  1950   8872247.0
4130              American Samoa  1950     18937.0
...                          ...   ...         ...
22256                     Zambia  2015  16211767.0
22257                   Zimbabwe  2015  15602751.0
22259                South Sudan  2015  12339812.0
22260                    Curaçao  2015    157203.0
22261  Sint Maarten (Dutch part)  2015     38745.0

[16741 rows x 3 columns]

In [45]:
data.to_csv('data/population_1950.csv', index=False)

In [46]:
import pandas as pd

data = pd.read_excel('data/life_expectancy.xls')
print(df)

                 population  fertility continent
Bangladesh     1.609956e+08       2.12      Asia
Brazil         2.078475e+08       1.78      Asia
China          1.376049e+09       1.57      Asia
India          1.311051e+09       2.43      Asia
Indonesia      2.575638e+08       2.28      Asia
Japan          1.265735e+08       1.45      Asia
Mexico         1.270172e+08       2.13      Asia
Nigeria        1.822020e+08       5.89      Asia
Pakistan       1.889249e+08       3.04      Asia
Philippines    1.006994e+08       2.98      Asia
Russia         1.434569e+08       1.61      Asia
United States  3.217736e+08       1.97      Asia

In [47]:
data.head()

         Life expectancy  year  life expectancy
0               Abkhazia  1800              NaN
1            Afghanistan  1800            28.21
2  Akrotiri and Dhekelia  1800              NaN
3                Albania  1800            35.40
4                Algeria  1800            28.82

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56420 entries, 0 to 56419
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Life expectancy  56420 non-null  object
 1   year             56420 non-null  int64
 2   life expectancy  43857 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ MB

In [49]:
data.columns

Index(['Life expectancy', 'year', 'life expectancy'], dtype='object')

In [50]:
data.columns = ['Life expectancy', 'year', 'life expectancy']

In [51]:
data.head()

         Life expectancy  year  life expectancy
0               Abkhazia  1800              NaN
1            Afghanistan  1800            28.21
2  Akrotiri and Dhekelia  1800              NaN
3                Albania  1800            35.40
4                Algeria  1800            28.82

In [52]:
data.rename(columns={'Life expectancy' : 'country'})

                     country  year  life expectancy
0                   Abkhazia  1800              NaN
1                Afghanistan  1800            28.21
2      Akrotiri and Dhekelia  1800              NaN
3                    Albania  1800            35.40
4                    Algeria  1800            28.82
...                      ...   ...              ...
56415             Yugoslavia  2016              NaN
56416                 Zambia  2016            57.10
56417               Zimbabwe  2016            61.69
56418                  Åland  2016              NaN
56419            South Sudan  2016            56.10

[56420 rows x 3 columns]

In [53]:
data.rename(columns={'Life expectancy' : 'country'}, 
            inplace=True)

In [54]:
data.head()

                 country  year  life expectancy
0               Abkhazia  1800              NaN
1            Afghanistan  1800            28.21
2  Akrotiri and Dhekelia  1800              NaN
3                Albania  1800            35.40
4                Algeria  1800            28.82

In [55]:
data.isnull().sum()

country                0
year                   0
life expectancy    12563
dtype: int64

In [56]:
data.dropna(inplace=True)

In [57]:
data.isnull().sum()

country            0
year               0
life expectancy    0
dtype: int64

In [58]:
boolean_mask_f = data['year']> 1949
data = data[boolean_mask_f]
data

                     country  year  life expectancy
39001            Afghanistan  1950            26.85
39003                Albania  1950            54.48
39004                Algeria  1950            42.77
39007                 Angola  1950            30.70
39009    Antigua and Barbuda  1950            57.97
...                      ...   ...              ...
56411  Virgin Islands (U.S.)  2016            80.82
56414                  Yemen  2016            64.92
56416                 Zambia  2016            57.10
56417               Zimbabwe  2016            61.69
56419            South Sudan  2016            56.10

[13707 rows x 3 columns]

In [59]:
data.to_csv('data/life_expectancy_1950.csv', index=False)